# Pandas - Basic Functionality

## Reading CSV and Excel Files

In [3]:
import pandas as pd
df = pd.read_excel(r"C:\Users\BHATTJ\Desktop\dataset.xlsx")

# Head and Tail

In [18]:
df

    Name  Age  Class
0   jay    25     12
1  vijay   26     10
2    raj   24      9

# Data Frame to Series with values

In [16]:
df.Name

0     jay
1    vijay
2      raj
Name: Name, dtype: object

# Check shape of your dataframe

In [17]:
df.shape

(3, 3)

# Transpose -- Most like numpy --

In [22]:
df

    Name  Age  Class
0   jay    25     12
1  vijay   26     10
2    raj   24      9

# describe my dataframe

In [21]:
df.describe()

        Age      Class
count   3.0   3.000000
mean   25.0  10.333333
std     1.0   1.527525
min    24.0   9.000000
25%    24.5   9.500000
50%    25.0  10.000000
75%    25.5  11.000000
max    26.0  12.000000